---
kind: property
id: P:Autodesk.Revit.DB.Events.ProgressChangedEventArgs.Position
source: html/3a48f343-428e-56f9-36c9-ee82cc732ef8.htm
---
# Autodesk.Revit.DB.Events.ProgressChangedEventArgs.Position Property

Progress bar position - value is always between zero and upperRange and is incremented by one with each event of stage "PositionChanged"

## Syntax (C#)
```csharp
public int Position { get; }
```